In [649]:
import pandas as pd
import numpy as np 
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from dmba import classificationSummary

In [650]:
test_df = pd.read_csv('./test.csv')
train_df = pd.read_csv('./train.csv')

In [651]:
train_df.info()
# 11 Variables.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [652]:
test_df.info() 
# 10 Variables, no survived column.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [653]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [654]:
train_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [655]:
test_df.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

In [656]:
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [657]:
test_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [658]:
#lambda function with apply method to quickly swap out the genders
train_df['Sex'] = train_df['Sex'].apply(lambda x: 1 if x == 'male' else 0) 
test_df['Sex'] = test_df['Sex'].apply(lambda x: 1 if x == 'male' else 0)

In [659]:
train_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [660]:
test_df

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",1,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",1,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",0,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",1,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",1,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",1,NaN,1,1,2668,22.3583,NaN,C

In [661]:
train_df.drop(columns=['Name','Cabin', 'Ticket'],axis = 1 , inplace=True)
test_df.drop(columns=['Name','Cabin', 'Ticket'],axis = 1 , inplace=True)

In [662]:
train_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Fare             0
Embarked         2
dtype: int64

In [663]:
test_df.isnull().sum()

PassengerId     0
Pclass          0
Sex             0
Age            86
SibSp           0
Parch           0
Fare            1
Embarked        0
dtype: int64

In [664]:
# Training dataframe, replacing missing age values with the mean age
imputer = SimpleImputer(missing_values = np.nan, strategy = 'mean')
imputer.fit(train_df.iloc[:, 4:5])
train_df.iloc[:, 4:5] = imputer.transform(train_df.iloc[:, 4:5])

In [665]:
test_df

     PassengerId  Pclass  Sex   Age  SibSp  Parch      Fare Embarked
0            892       3    1  34.5      0      0    7.8292        Q
1            893       3    0  47.0      1      0    7.0000        S
2            894       2    1  62.0      0      0    9.6875        Q
3            895       3    1  27.0      0      0    8.6625        S
4            896       3    0  22.0      1      1   12.2875        S
..           ...     ...  ...   ...    ...    ...       ...      ...
413         1305       3    1   NaN      0      0    8.0500        S
414         1306       1    0  39.0      0      0  108.9000        C
415         1307       3    1  38.5      0      0    7.2500        S
416         1308       3    1   NaN      0      0    8.0500        S
417         1309       3    1   NaN      1      1   22.3583        C

[418 rows x 8 columns]

In [666]:
# Test dataframe, replacing missing age values with the mean age
imputer = SimpleImputer(missing_values = np.nan, strategy = 'mean')
imputer.fit(test_df.iloc[:, 3:4])
test_df.iloc[:, 3:4] = imputer.transform(test_df.iloc[:, 3:4])

In [667]:
# Test dataframe, replacing missing fare value with the mode fare
imputer = SimpleImputer(missing_values = np.nan, strategy = 'most_frequent')
imputer.fit(test_df.iloc[:, -2:-1])
test_df.iloc[:, -2:-1] = imputer.transform(test_df.iloc[:, -2:-1])

In [668]:
train_df.dropna(axis=0, how='any', inplace=True)

In [669]:
test_df.shape

(418, 8)

In [670]:
# Data types of columns 
for c in train_df:
    print (c , "-", train_df[c].dtype)

PassengerId - int64
Survived - int64
Pclass - int64
Sex - int64
Age - float64
SibSp - int64
Parch - int64
Fare - float64
Embarked - object

In [671]:
# Data types of columns 
for c in test_df:
    print (c , "-", test_df[c].dtype)

PassengerId - int64
Pclass - int64
Sex - int64
Age - float64
SibSp - int64
Parch - int64
Fare - float64
Embarked - object

In [672]:
# Train dataframe - converting data type to category 
train_df['Embarked'] = train_df['Embarked'].astype('category')

# Train dataframe - creating dummy variables for the 3 columns
train_df = pd.get_dummies(train_df,prefix_sep='_', drop_first=False)


# How to include specific columns in pd.getdummies without using a column transformer, 
# testing = pd.get_dummies(test_data, columns=["Pclass","Embarked","Sex"])


# Test dataframe - converting data type to category 
test_df['Embarked'] = test_df['Embarked'].astype('category')
# Test dataframe - creating dummy variables for the 3 columns
test_df = pd.get_dummies(test_df,prefix_sep='_', drop_first=False)

In [673]:
train_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch',
       'Fare', 'Embarked_C', 'Embarked_Q', 'Embarked_S'],
      dtype='object')

In [674]:
train_df

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S
0,1,0,3,1,22.000000,1,0,7.2500,0,0,1
1,2,1,1,0,38.000000,1,0,71.2833,1,0,0
2,3,1,3,0,26.000000,0,0,7.9250,0,0,1
3,4,1,1,0,35.000000,1,0,53.1000,0,0,1
4,5,0,3,1,35.000000,0,0,8.0500,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,1,27.000000,0,0,13.0000,0,0,1
887,888,1,1,0,19.000000,0,0,30.0000,0,0,1
888,889,0,3,0,29.699118,1,2,23.4500,0,0,1
889,890,1,1,1,26.000000,0,0,30.0000,1,0,0
890,891,0,3,1,32.000000,0,0,7.7500,0,1,0

In [675]:
group_1 = ['Pclass',  'Age', 'SibSp', 'Parch', 'Fare']
group_2 = [ 'Sex', 'Embarked_C', 'Embarked_Q','Embarked_S','Survived','PassengerId']

In [676]:
new_cols = group_1 + group_2

In [677]:
set(train_df) == set(new_cols)

True

In [678]:
train_df_2 = train_df[new_cols]

In [679]:
train_df_2['Pclass_1'] = train_df_2['Pclass'].apply(lambda x: 1 if x == 1 else 0)
train_df_2['Pclass_2'] = train_df_2['Pclass'].apply(lambda x: 1 if x == 2 else 0)
train_df_2['Pclass_3'] = train_df_2['Pclass'].apply(lambda x: 1 if x == 3 else 0)

train_df_2.drop('Pclass', axis = 1, inplace = True)

<ipython-input-679-82ce5cdf8558>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train_df_2['Pclass_1'] = train_df_2['Pclass'].apply(lambda x: 1 if x == 1 else 0)
<ipython-input-679-82ce5cdf8558>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train_df_2['Pclass_2'] = train_df_2['Pclass'].apply(lambda x: 1 if x == 2 else 0)
<ipython-input-679-82ce5cdf8558>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train_df_2['Pclass_3'] = train_df_2['Pclass'].apply(lambda x: 1 if x == 3 else 0)
C:\Users\User\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\core\frame.py:4308: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

In [680]:
#train_df_2.drop(columns = ['PassengerId'], axis = 1 , inplace=True)

In [681]:
train_df_2.head()

,Age,SibSp,Parch,Fare,Sex,Embarked_C,Embarked_Q,Embarked_S,Survived,PassengerId,Pclass_1,Pclass_2,Pclass_3
0,22.0,1,0,7.2500,1,0,0,1,0,1,0,0,1
1,38.0,1,0,71.2833,0,1,0,0,1,2,1,0,0
2,26.0,0,0,7.9250,0,0,0,1,1,3,0,0,1
3,35.0,1,0,53.1000,0,0,0,1,1,4,1,0,0
4,35.0,0,0,8.0500,1,0,0,1,0,5,0,0,1

In [682]:
train_df_2.columns

Index(['Age', 'SibSp', 'Parch', 'Fare', 'Sex', 'Embarked_C', 'Embarked_Q',
       'Embarked_S', 'Survived', 'PassengerId', 'Pclass_1', 'Pclass_2',
       'Pclass_3'],
      dtype='object')

In [683]:
group_3 = ['Age', 'SibSp', 'Parch', 'Fare']
group_4 = [ 'Sex', 'Embarked_C', 'Embarked_Q', 'Embarked_S', 'Pclass_1','Pclass_2', 'Pclass_3', 'PassengerId', 'Survived']

In [684]:
new_cols_2 = group_3 + group_4

In [685]:
set(train_df_2) == set(new_cols_2)

True

In [686]:
train_df_2 = train_df_2[new_cols_2]

In [687]:
train_df_2.head()

,Age,SibSp,Parch,Fare,Sex,Embarked_C,Embarked_Q,Embarked_S,Pclass_1,Pclass_2,Pclass_3,PassengerId,Survived
0,22.0,1,0,7.2500,1,0,0,1,0,0,1,1,0
1,38.0,1,0,71.2833,0,1,0,0,1,0,0,2,1
2,26.0,0,0,7.9250,0,0,0,1,0,0,1,3,1
3,35.0,1,0,53.1000,0,0,0,1,1,0,0,4,1
4,35.0,0,0,8.0500,1,0,0,1,0,0,1,5,0

In [688]:
X = train_df_2.iloc[:,:-2]
y = train_df_2.iloc[:, -1]

In [689]:
X_train, X_valid, y_train, y_valid = train_test_split(X, y, test_size = 0.2, random_state= 1)

In [690]:
sc = StandardScaler()
# standardizing non-binary columns in X_train
X_train.iloc[:, :4] = sc.fit_transform(X_train.iloc[:, :4])

# standardizing non-binary columns in X_test
X_valid.iloc[:, :4] = sc.transform(X_valid.iloc[:, :4])

C:\Users\User\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\core\indexing.py:1738: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value[:, i].tolist(), pi)
C:\Users\User\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\core\indexing.py:1738: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value[:, i].tolist(), pi)

In [691]:
# fitting the logistic regression (penalty=l2 and C=1e42 to avoid regularization)
log_reg = LogisticRegression(penalty="l2", C=1e42, solver='liblinear')

log_reg.fit(X_train, y_train)

LogisticRegression(C=1e+42, solver='liblinear')

In [692]:
val_preds = log_reg.predict(X_valid)

val_preds_df = pd.DataFrame(val_preds, index = y_valid.index, columns = ['Survived_Predicted'])

log_reg_proba = log_reg.predict_proba(X_valid)

probab_result = pd.DataFrame({'p(0)': [p[0] for p in log_reg_proba],
                             'p(1)': [p[1] for p in log_reg_proba]}, index = y_valid.index)

In [693]:
val_results = pd.concat([y_valid, probab_result, val_preds_df], axis = 1)

In [694]:
val_results

     Survived      p(0)      p(1)  Survived_Predicted
387         1  0.240998  0.759002                   1
259         1  0.362359  0.637641                   1
771         0  0.953232  0.046768                   0
208         1  0.244147  0.755853                   1
683         0  0.956710  0.043290                   0
..        ...       ...       ...                 ...
499         0  0.887314  0.112686                   0
731         0  0.731903  0.268097                   0
373         0  0.303650  0.696350                   1
588         0  0.879124  0.120876                   0
234         0  0.704627  0.295373                   0

[178 rows x 4 columns]

In [695]:
#Confusion Matrix 

classificationSummary(y_train, log_reg.predict(X_train))
classificationSummary(y_valid, log_reg.predict(X_valid))

Confusion Matrix (Accuracy 0.7975)

       Prediction
Actual   0   1
     0 385  59
     1  85 182
Confusion Matrix (Accuracy 0.8315)

       Prediction
Actual  0  1
     0 91 14
     1 16 57

In [696]:
test_df

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S
0,892,3,1,34.50000,0,0,7.8292,0,1,0
1,893,3,0,47.00000,1,0,7.0000,0,0,1
2,894,2,1,62.00000,0,0,9.6875,0,1,0
3,895,3,1,27.00000,0,0,8.6625,0,0,1
4,896,3,0,22.00000,1,1,12.2875,0,0,1
...,...,...,...,...,...,...,...,...,...,...
413,1305,3,1,30.27259,0,0,8.0500,0,0,1
414,1306,1,0,39.00000,0,0,108.9000,1,0,0
415,1307,3,1,38.50000,0,0,7.2500,0,0,1
416,1308,3,1,30.27259,0,0,8.0500,0,0,1
417,1309,3,1,30.27259,1,1,22.3583,1,0,0

In [697]:
test_df['Pclass_1'] = test_df['Pclass'].apply(lambda x: 1 if x == 1 else 0)
test_df['Pclass_2'] = test_df['Pclass'].apply(lambda x: 1 if x == 2 else 0)
test_df['Pclass_3'] = test_df['Pclass'].apply(lambda x: 1 if x == 3 else 0)

In [698]:
test_df.drop('Pclass', axis = 1 , inplace = True)

In [699]:
test_df.columns

Index(['PassengerId', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare', 'Embarked_C',
       'Embarked_Q', 'Embarked_S', 'Pclass_1', 'Pclass_2', 'Pclass_3'],
      dtype='object')

In [700]:
group_5 = ['Age', 'SibSp', 'Parch', 'Fare', 'Sex']
group_6 = ['Embarked_C', 'Embarked_Q', 'Embarked_S', 'Pclass_1', 'Pclass_2', 'Pclass_3', 'PassengerId']

In [701]:
new_cols_3 = group_5 + group_6

In [702]:
set(test_df) == set(new_cols_3)

True

In [703]:
final_test = test_df[new_cols_3]

In [704]:
# standardizing non-binary columns in final_test
final_test.iloc[:, :4] = sc.fit_transform(final_test.iloc[:, :4])

In [705]:
final_test.isnull().sum()

Age            0
SibSp          0
Parch          0
Fare           0
Sex            0
Embarked_C     0
Embarked_Q     0
Embarked_S     0
Pclass_1       0
Pclass_2       0
Pclass_3       0
PassengerId    0
dtype: int64

In [706]:
X = final_test.iloc[:, :-1]

In [707]:
test_preds = log_reg.predict(X)

test_preds_df = pd.DataFrame(test_preds, index = final_test.index, columns = ['Survived'])

In [708]:
test_preds_df = pd.concat([final_test['PassengerId'],test_preds_df], axis = 1)

In [709]:
test_preds_df.to_csv('submission.csv', index = False)

In [711]:
test_preds_df.shape

(418, 2)